Tekla.Structures.Drawing.PickerInputWithinAView
The PickerInputWithinAView class is the base class of PickerInput instances that represent
a valid pick of point(s) or object(s) in a view.

Tekla.Structures.Drawing.PickerInputWithinAView.PickedView
The view within which the pick occurred.

Tekla.Structures.Drawing.PickerInputWithinAView.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.PickerInputWithinAView.#ctor
Default constructor for PickerInput derived classes for which PickedView is not known at
construction time. Do not use if the view is known - prefer the
PickerInputWithinAView(ViewBase view) constructor.

Tekla.Structures.Drawing.PickerInputWithinAView.#ctor(Tekla.Structures.Drawing.ViewBase)
The base constructor for PickerInput derived classes representing picks in a view.
view: The view where the pick occurred.